/*--------Оператори порівняння--------*/
a == b          //якщо a дорівнює b
a != b          //якщо a не дорівнює b
a > b           //якщо a більше b
a < b           //якщо a менше b
a >= b          //якщо a білььше або дорівне b
a <= b          //якщо a менше або дорівнює b

/*--------Логічні оператори--------*/
&&      // логічне І (одна умова І друга)
||      // логічне АБО (АБО одне, АБО інише)
!       // заперечання (наприклад if(!val) - якщо val - брехня, тобто 0)

/*--------Оператор умови if--------*/
if(){}  // оператор умови, перевіряє правдивість в () і виконує код в {}, якщо все правильно

if(){   // перевіряє умову, якщо правильно, 
        // виконує цю частину коду
}else{  // якщо неправильно
        // виконуємо цю частину коду
}

//можна зробити декілька умов одночасно:

if(){       // перевіряє умову, виконує якщо правильно
}else if(){ // якщо не правильно, перевіряємо нове
}else if(){ // якщо не правильно, перевіряємо нове
}else{      // якщо не правильно, виконує те, що нижче
}
