/*--------Цикл for--------*/
for(counter; condition; change){} // цикл for
// counter - змінна лічильника, зазвичай створюють нову "локальну", в стилі int i = 0;
// condition - умова, при якій виконується цикл, наприклад, "лічильник менше 5" i < 5;
// change - зміна, тобто збільшення або зменшення лічилььника, наприклад, i++, i--, i += 10;

//Приклад:

for(int i = 0; i < 100; i++){   // лічильник від 0 до 99
    cout << i;                  // вивести в термінал числа від 0 до 99
}

break; // вийти з циклу
