/*--------Типи змінних--------*/

int i_val;      // зберігає цілі числа
double d_val;   // зберігає числа з плаваючою комою (десяткові дроби)
char c_val;     // зберігає окремі символи, які зазначаються в одинарних лапках ('a', ',')
string s_val;   // зберігає текст, зазначений в подвійних лапках("Hello")
bool b_val;     // зберігає значення з двома станами: true або false
int a, b, x;    // оголошувати змінні одного типу можна через кому
double y = 1.2; // присвоюємо змінній у значення 1.2, для водальшого використання, тип вказувати не потріно

/*------Константи--------*/
const int c_i_val = 100; // для оголошення сталої потрібно додати, до типу змінної, const, і одразу присвоїти їй якесь значення
