#include <iostream>         // під'єднуємо бібліотеку для роботи з терміналом
using namespace std;        // для роботи з бібліотекою вводу/виводу буз оголошення назви на початку кожної функції

int x;                      // оголошуємо змінну типу int, яка називається x

int main(){                 // функція, де відбуваються всі дії, які нам потрібні
    cout << "Hello, World"; // вивести в термінал фразу "Hello, World", слова пишуться в подвійних лапках
    cin >> x;               // прийняти в термінал значення для змінної x
    cout << x;              // для виводу чисел та змінних лапки не потрібні
    return 0;               // відключаємо повтор
}
