/*--------Математичні функції C++--------*/ 
#include <math.h>

int a, b, x, y, z;

+ , -, *, / ; // додати, відняти, помножити, поділити
min(a, b);    // Повертає менше з чисел a i b
max(a, b);    // Повертає більше з чисел a i b
abs(x);       // Модуль числа
round(x);     // Математичне округлення
sq(x);        // Квадрат числа
cos(x);       // Косинус (радіани)
sin(x);       // Сінус (радіани)
tan(x);       // Тангенс (радіани)
fabs(x);      // Модуль для float числа
sqrt(x);      // Корінь квадратний
sqrtf(x);     // Корінь квадратний для float числа
cbrt(x);      // Кубічний корінь
square(x);    // Квадрат ( x * x )
floor(x);     // Округлення до цілого вниз
ceil(x);      // Округлення до цілого вверх
exp(x);       // Експонента (e ^ x)
acos(x);      // Арккосинус
asin(x);      // Арксінус
atan(x);      // Арктангенс
log(x);       // Натуральний логарифм
log10(x);     // Десфтковий логарифм
pow(x, y);    // Степінь (x ^ y)
fma(x, y, z); // Повертає x * y + z
trunc(x);     // Повертає цілу частину числа з дробною точкою

/*--------Сталі(константи)--------*/

M_E    // 2.718281828 Число e 
M_PI   // 3.141592654 пі
M_PI_2 // 1.570796327 пі/2
TMO_PI // 6.283185307 два пі
EULER  // 2.718281828 Число e
